Infineon/IMR_PSoC6_BMS/proj_cm4/Libraries/BMS_TLE9012/tle9012_registers.c
/*
 * tle9012_registers.c
 *
 *	Library for TLE9012 Li-Ion battery monitoring and balancing system IC.
 *	See main file Lib_TLE9012.c for how to use guide
 *	Created by R. Santeler @ Infineon 2024
 *
*******************************************************************************
 * (c) (2024), Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product").
 * By including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing so
 * agrees to indemnify Cypress against all liability.
*******************************************************************************/

#include <stdio.h>
#include <stdint.h>
#include <ctype.h>
#include <stdlib.h> // includes strtol

#include "tle9012_target.h"
#include "tle9012_registers.h"

//****************************************************************************
// Definitions and Objects for the queuing system
//****************************************************************************
// Debug definitions - comment "DEBUGPRINTF(p_frm, ##__VA_ARGS__)" out to remove messages from build
#define DEBUGPRINTF_BITMAP_CHANGE(p_frm, ...) //DEBUGPRINTF(p_frm, ##__VA_ARGS__)
#define DEBUGPRINTF_WATCHDOG(p_frm, ...)      //DEBUGPRINTF(p_frm, ##__VA_ARGS__)

tle9012_node tle9012_nodes[TLE9012_NODES_SIZE] = {0};
uint8_t multi_read_cfg_reg_idx_list[23] = {0};
uint8_t multi_read_cfg_reg_idx_list_num = 0;

uint32_t timeLastWatchdogRefresh = 0;

//****************************************************************************
// Global variables for register and bit names (Note that index and address differs)
//****************************************************************************
// Register index to address and label
reg_item  reg_items[NUM_REGISTERS] = {
    {0x0001, "PART_CONFIG"},
    {0x0002, "OL_OV_THR"},
    {0x0003, "OL_UV_THR"},
    {0x0004, "TEMP_CONF"},
    {0x0005, "INT_OT_WARN_CONF"},
    {0x0008, "RR_ERR_CNT"},
    {0x0009, "RR_CONFIG"},
    {0x000A, "FAULT_MASK"},
    {0x000B, "GEN_DIAG"},
    {0x000C, "CELL_UV"},
    {0x000D, "CELL_OV"},
    {0x000E, "EXT_TEMP_DIAG"},
    {0x0010, "DIAG_OL"},
    {0x0011, "REG_CRC_ERR"},
    {0x0012, "CELL_UV_DAC_COMP"},
    {0x0013, "CELL_OV_DAC_COMP"},
    {0x0014, "OP_MODE"},
    {0x0015, "BAL_CURR_THR"},
    {0x0016, "BAL_SETTINGS"},
    {0x0017, "AVM_CONFIG"},
    {0x0018, "MEAS_CTRL"},
	{0x0019, "PCVM_0"},
	{0x001A, "PCVM_1"},
	{0x001B, "PCVM_2"},
	{0x001C, "PCVM_3"},
	{0x001D, "PCVM_4"},
	{0x001E, "PCVM_5"},
	{0x001F, "PCVM_6"},
	{0x0020, "PCVM_7"},
	{0x0021, "PCVM_8"},
	{0x0022, "PCVM_9"},
	{0x0023, "PCVM_10"},
	{0x0024, "PCVM_11"},
    {0x0025, "SCVM_HIGH"},
    {0x0026, "SCVM_LOW"},
    {0x0027, "STRESS_PCVM"},
    {0x0028, "BVM"},
    {0x0029, "EXT_TEMP_0"},
    {0x002A, "EXT_TEMP_1"},
    {0x002B, "EXT_TEMP_2"},
    {0x002C, "EXT_TEMP_3"},
    {0x002D, "EXT_TEMP_4"},
    {0x002F, "EXT_TEMP_R_DIAG"},
    {0x0030, "INT_TEMP"},
    {0x0031, "MULTI_READ"},
    {0x0032, "MULTI_READ_CFG"},
    {0x0033, "BAL_DIAG_OC"},
    {0x0034, "BAL_DIAG_UC"},
    {0x0035, "INT_TEMP_2"},
    {0x0036, "CONFIG"},
    {0x0037, "GPIO"},
    {0x0038, "GPIO_PWM"},
    {0x0039, "ICVID"},
    {0x003A, "MAILBOX"},
    {0x003B, "CUSTOMER_ID_0"},
    {0x003C, "CUSTOMER_ID_1"},
    {0x003D, "WDOG_CNT"},
    {0x003E, "SCVM_CONFIG"},
    {0x003F, "STRESS_AUX"},
    {0x005B, "BAL_PWM"},
    {0x005C, "BAL_CNT_0"},
    {0x005D, "BAL_CNT_1"},
    {0x005E, "BAL_CNT_2"},
    {0x005F, "BAL_CNT_3"},
};

// Items for every subregister/setting containing: main register index,
// bitmask of specific setting and label
const subreg_item  PART_CONFIG__EN_CELLi = 				{0 ,0b0000011111111111, "EN_CELLi"};			 // RW - Enable cell monitoring for cell i
const subreg_item  PART_CONFIG__EN_CELL11 = 			{0 ,0b0000100000000000, "EN_CELL11"};			 // RW - Enable cell monitoring for cell 11
const subreg_item  OL_OV_THR__OV_THR = 					{1 ,0b0000001111111111, "OV_THR"};				 // RW - Overvoltage fault threshold 10-bit overvoltage fault threshold.
																										 // Battery input voltages (U0 to U11)are tested for overvoltage with given value.
																										 // OV error is detected andindicated in GEN_DIAG register if cell voltage is higher than OV faultthreshold.
const subreg_item  OL_OV_THR__OL_THR_MAX = 				{1 ,0b1111110000000000, "OL_THR_MAX"};			 // RW - Open load maximum voltage drop threshold (LSB8) 6-bit (LSB8) to define the maximum threshold for the voltage dropwhile OL-diagnostics (I OL_DIAG * R F).
																										 // If voltage drop > OL_THR_MAX, theOLx bit of channel x is set.
const subreg_item  OL_UV_THR__UV_THR = 					{2 ,0b0000001111111111, "UV_THR"};				 // RW - Undervoltage fault threshold 10-bit undervoltage fault threshold.
																										 // Battery input voltages (U0 to U11)are tested for undervoltage with given value.
																										 // UV error is detected andindicated in GEN_DIAG register if cell voltage is lower than UV faultthreshold.
const subreg_item  OL_UV_THR__OL_THR_MIN = 				{2 ,0b1111110000000000, "OL_THR_MIN"};			 // RW - Open load minimum voltage drop threshold (LSB8) 6-bit (LSB8) to define the minimum threshold for the voltage drop whileOL-diagnostics (I OL_DIAG * R F).
																										 // If voltage drop < OL_THR_MIN, the OLxbit of channel x is set.
const subreg_item  TEMP_CONF__EXT_OT_THR = 				{3 ,0b0000001111111111, "EXT_OT_THR"};			 // RW - External overtemperature threshold 10-bit overtemperature fault threshold.
																										 // Overtemperature error isdetected and indicated in GEN_DIAG register if the externaltemperature result is lower than the fault threshold. Balancing isdeactivated.
const subreg_item  TEMP_CONF__I_NTC = 					{3 ,0b0000110000000000, "I_NTC"};				 // RW - Current source used for OT fault
const subreg_item  TEMP_CONF__NR_TEMP_SENSE = 			{3 ,0b0111000000000000, "NR_TEMP_SENSE"};		 // RW - Number of external temperature sensors
const subreg_item  INT_OT_WARN_CONF__INT_OT_THR = 		{4 ,0b0000001111111111, "INT_OT_THR"};			 // RW - Internal overtemperature threshold 10-bit overtemperature fault threshold.
																										 // Overtemperature error isdetected and indicated in GEN_DIAG register if the internal temperatureresult is LOWER than the fault threshold. Balancing is deactivated.
const subreg_item  RR_ERR_CNT__NR_ERR = 				{5 ,0b0000000000000111, "NR_ERR"};				 // RW - Number of errors Number of consecutive detected errors before error is valid and setin GEN_DIAG and individual fault registers.
																										 // Only used for faults wherecounter NR_ERR is active (this can be set in register NR_ERR_MASK).
																										 // Please note: The register CRC errors as well as the internal IC errors donot have an error counter.
const subreg_item  RR_ERR_CNT__NR_EXT_TEMP_START = 		{5 ,0b0000000000111000, "NR_EXT_TEMP_START"};	 // RW - External temperature triggering in round robin
const subreg_item  RR_ERR_CNT__RR_SLEEP_CNT = 			{5 ,0b1111111111000000, "RR_SLEEP_CNT"};		 // RW - Round robin timing in sleep mode
const subreg_item  RR_CONFIG__RR_CNT = 					{6 ,0b0000000001111111, "RR_CNT"};				 // RW - Round robin counter
const subreg_item  RR_CONFIG__RR_SYNC = 				{6 ,0b0000000010000000, "RR_SYNC"};				 // RW - Round robin synchronization
const subreg_item  RR_CONFIG__M_NR_ERR_ADC_ERR = 		{6 ,0b0000000100000000, "M_NR_ERR_ADC_ERR"};	 // RW - Mask NR_ERR counter for ADC error
const subreg_item  RR_CONFIG__M_NR_ERR_OL_ERR = 		{6 ,0b0000001000000000, "M_NR_ERR_OL_ERR"};		 // RW - Mask NR_ERR counter for open load error
const subreg_item  RR_CONFIG__M_NR_ERR_EXT_T_ERR = 		{6 ,0b0000010000000000, "M_NR_ERR_EXT_T_ERR"};	 // RW - Mask NR_ERR counter for external temperature error
const subreg_item  RR_CONFIG__M_NR_ERR_INT_OT = 		{6 ,0b0000100000000000, "M_NR_ERR_INT_OT"};		 // RW - Mask NR_ERR counter for internal temperature error
const subreg_item  RR_CONFIG__M_NR_ERR_CELL_UV = 		{6 ,0b0001000000000000, "M_NR_ERR_CELL_UV"};	 // RW - Mask NR_ERR counter for undervoltage error
const subreg_item  RR_CONFIG__M_NR_ERR_CELL_OV = 		{6 ,0b0010000000000000, "M_NR_ERR_CELL_OV"};	 // RW - Mask NR_ERR counter for overvoltage error
const subreg_item  RR_CONFIG__M_NR_ERR_BAL_UC = 		{6 ,0b0100000000000000, "M_NR_ERR_BAL_UC"};		 // RW - Mmask NR_ERR counter for balancing error undercurrent
const subreg_item  RR_CONFIG__M_NR_ERR_BAL_OC = 		{6 ,0b1000000000000000, "M_NR_ERR_BAL_OC"};		 // RW - Mask NR_ERR counter for balancing error overcurrent
const subreg_item  FAULT_MASK__ERR_PIN = 				{7 ,0b0000000000100000, "ERR_PIN"};				 // RW - Enable Error PIN functionality
const subreg_item  FAULT_MASK__M_ADC_ERR = 				{7 ,0b0000000001000000, "M_ADC_ERR"};			 // RW - EMM/ERR mask for ADC error
const subreg_item  FAULT_MASK__M_OL_ERR = 				{7 ,0b0000000010000000, "M_OL_ERR"};			 // RW - EMM/ERR mask for open load error
const subreg_item  FAULT_MASK__M_INT_IC_ERR = 			{7 ,0b0000000100000000, "M_INT_IC_ERR"};		 // RW - EMM/ERR mask for internal IC error
const subreg_item  FAULT_MASK__M_REG_CRC_ERR = 			{7 ,0b0000001000000000, "M_REG_CRC_ERR"};		 // RW - EMM/ERR mask for register CRC error
const subreg_item  FAULT_MASK__M_EXT_T_ERR = 			{7 ,0b0000010000000000, "M_EXT_T_ERR"};			 // RW - EMM/ERR mask for external temperature error
const subreg_item  FAULT_MASK__M_INT_OT = 				{7 ,0b0000100000000000, "M_INT_OT"};			 // RW - EMM/ERR mask for internal temperature error
const subreg_item  FAULT_MASK__M_CELL_UV = 				{7 ,0b0001000000000000, "M_CELL_UV"};			 // RW - EMM/ERR mask for cell undervoltage error
const subreg_item  FAULT_MASK__M_CELL_OV = 				{7 ,0b0010000000000000, "M_CELL_OV"};			 // RW - EMM/ERR mask for cell overvoltage error
const subreg_item  FAULT_MASK__M_BAL_ERR_UC = 			{7 ,0b0100000000000000, "M_BAL_ERR_UC"};		 // RW - EMM/ERR mask for balancing error undercurrent
const subreg_item  FAULT_MASK__M_BAL_ERR_OC = 			{7 ,0b1000000000000000, "M_BAL_ERR_OC"};		 // RW - EMM/ERR mask for balancing error overcurrent
const subreg_item  GEN_DIAG__UART_WAKEUP = 				{8 ,0b0000000000000001, "UART_WAKEUP"};			 // RH - Wake-up via UART
const subreg_item  GEN_DIAG__MOT_MOB_N = 				{8 ,0b0000000000000010, "MOT_MOB_N"};			 // RH - Primary on Top/Bottom configuration
const subreg_item  GEN_DIAG__BAL_ACTIVE = 				{8 ,0b0000000000000100, "BAL_ACTIVE"};			 // RH - Balancing active
const subreg_item  GEN_DIAG__LOCK_MEAS = 				{8 ,0b0000000000001000, "LOCK_MEAS"};			 // RH - Lock measurement
																										 // This bit indicates an ongoing PCVM, SCVM, BVM or AVM measurement or a delayed RR.
const subreg_item  GEN_DIAG__RR_ACTIVE = 				{8 ,0b0000000000010000, "RR_ACTIVE"};			 // RH - Round robin active This bit indicates if the round robin was active during read.
const subreg_item  GEN_DIAG__PS_ERR_SLEEP = 			{8 ,0b0000000000100000, "PS_ERR_SLEEP"};		 // ROCW - Power supply error induced sleep
const subreg_item  GEN_DIAG__ADC_ERR = 					{8 ,0b0000000001000000, "ADC_ERR"};				 // ROCW - ADC Error
const subreg_item  GEN_DIAG__OL_ERR = 					{8 ,0b0000000010000000, "OL_ERR"};				 // ROCWL - Open load error
																										 // Please note: Resetting the error here resets also the respective detailederror register.
const subreg_item  GEN_DIAG__INT_IC_ERR = 				{8 ,0b0000000100000000, "INT_IC_ERR"};			 // ROCW - Internal IC error
const subreg_item  GEN_DIAG__REG_CRC_ERR = 				{8 ,0b0000001000000000, "REG_CRC_ERR"};			 // ROCWL - Register CRC error
																										 // Please note: Resetting the error here resets also the respective detailederror register.
const subreg_item  GEN_DIAG__EXT_T_ERR = 				{8 ,0b0000010000000000, "EXT_T_ERR"};			 // ROCWL - External temperature error
																										 // Please note: Resetting the error here resets also the respective detailederror register.
const subreg_item  GEN_DIAG__INT_OT = 					{8 ,0b0000100000000000, "INT_OT"};				 // ROCW - Internal temperature (OT) error
const subreg_item  GEN_DIAG__CELL_UV = 					{8 ,0b0001000000000000, "CELL_UV"};				 // ROCWL - Cell undervoltage (UV) error
																										 // Please note: Resetting the error here resets also the respective detailederror register.
const subreg_item  GEN_DIAG__CELL_OV = 					{8 ,0b0010000000000000, "CELL_OV"};				 // ROCWL - Cell overvoltage (OV) error
																										 // Please note: Resetting the error here resets also the respective detailederror register.
const subreg_item  GEN_DIAG__BAL_ERR_UC = 				{8 ,0b0100000000000000, "BAL_ERR_UC"};			 // ROCWL - Balancing error undercurrent (will be reset in sleep mode)
																										 // Please note: Resetting the error here resets also the respective detailederror register.
const subreg_item  GEN_DIAG__BAL_ERR_OC = 				{8 ,0b1000000000000000, "BAL_ERR_OC"};			 // ROCWL - Balancing error overcurrent (will be reset in sleep mode)
																										 // Please Note: Resetting the error here resets also the respective detailederror register.
const subreg_item  CELL_UV__UV_i = 						{9 ,0b0000111111111111, "UV_i"};				 // ROCW - Undervoltage in cell i Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  CELL_OV__OV_i = 						{10 ,0b0000111111111111, "OV_i"};				 // ROCW - Overvoltage in cell i Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__OPEN0 = 				{11 ,0b0000000000000001, "OPEN0"};				 // ROCW - Open load in external temp 0 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__SHORT0 = 				{11 ,0b0000000000000010, "SHORT0"};				 // ROCW - Short in external temp 0 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__OT0 = 				{11 ,0b0000000000000100, "OT0"};				 // ROCW - Overtemperature in external temp 0 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__OPEN1 = 				{11 ,0b0000000000001000, "OPEN1"};				 // ROCW - Open load in external temp 1 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__SHORT1 = 				{11 ,0b0000000000010000, "SHORT1"};				 // ROCW - Short in external temp 1 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__OT1 = 				{11 ,0b0000000000100000, "OT1"};				 // ROCW - Overtemperature in external temp 1 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__OPEN2 = 				{11 ,0b0000000001000000, "OPEN2"};				 // ROCW - Open load in external temp 2 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__SHORT2 = 				{11 ,0b0000000010000000, "SHORT2"};				 // ROCW - Short in external temp 2 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__OT2 = 				{11 ,0b0000000100000000, "OT2"};				 // ROCW - Overtemperature in external temp 2 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__OPEN3 = 				{11 ,0b0000001000000000, "OPEN3"};				 // ROCW - Open load in external temp 3 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__SHORT3 = 				{11 ,0b0000010000000000, "SHORT3"};				 // ROCW - Short in external temp 3 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__OT3 = 				{11 ,0b0000100000000000, "OT3"};				 // ROCW - Overtemperature in external temp 3 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__OPEN4 = 				{11 ,0b0001000000000000, "OPEN4"};				 // ROCW - Open load in external temp 4 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__SHORT4 = 				{11 ,0b0010000000000000, "SHORT4"};				 // ROCW - Short in external temp 4 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  EXT_TEMP_DIAG__OT4 = 				{11 ,0b0100000000000000, "OT4"};				 // ROCW - Overtemperature in external temp 4 Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  DIAG_OL__OL_i = 						{12 ,0b0000111111111111, "OL_i"};				 // ROCW - Open load channel i Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  REG_CRC_ERR__ADDR = 					{13 ,0b0000000001111111, "ADDR"};				 // ROCW - Register address of register where CRC check failed Register address of CRC check fail,
																										 // can also be cleared on write '0' toconnected GEN_DIAG register bit.
const subreg_item  CELL_UV_DAC_COMP__UV_i = 			{14 ,0b0000111111111111, "UV_i"};				 // ROCW - Undervoltage in cell i Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  CELL_OV_DAC_COMP__OV_i = 			{15 ,0b0000111111111111, "OV_i"};				 // ROCW - Overvoltage in cell i Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  OP_MODE__PD = 						{16 ,0b0000000000000001, "PD"};					 // RW - Activate sleep mode
const subreg_item  OP_MODE__EXT_WD = 					{16 ,0b0000000000000010, "EXT_WD"};				 // RW - Extended watchdog
const subreg_item  OP_MODE__SLEEP_REG_RESET = 			{16 ,0b0000000000000100, "SLEEP_REG_RESET"};	 // RWH - Sleep mode registers reset
const subreg_item  OP_MODE__I_DIAG_EN = 				{16 ,0b0000000000001000, "I_DIAG_EN"};			 // RW - Force OL diagnostics currents
const subreg_item  OP_MODE__LR_TIME = 					{16 ,0b1111110000000000, "LR_TIME"};			 // RW - Long-running mode measurement restart time
const subreg_item  BAL_CURR_THR__OC_THR = 				{17 ,0b0000000011111111, "OC_THR"};				 // RW - Overcurrent fault threshold 8-bit to define the maximum voltage drop during balancingdiagnostics.
																										 // If the voltage drop (I Bal*R F) > OC_THR the overcurrentis detected.
const subreg_item  BAL_CURR_THR__UC_THR = 				{17 ,0b1111111100000000, "UC_THR"};				 // RW - Undercurrent fault threshold 8-bit to define the minimum voltage drop during balancing diagnostics.
																										 // If the voltage drop (I Bal*R F) < UC_THR the undercurrent is detected.
const subreg_item  AVM_CONFIG__TEMP_MUX_DIAG_SEL = 		{19 ,0b0000000000000111, "TEMP_MUX_DIAG_SEL"};	 // RW - Selector for external temp diagnose
const subreg_item  AVM_CONFIG__AVM_TMP0_MASK = 			{19 ,0b0000000000001000, "AVM_TMP0_MASK"};		 // RW - Activate auxiliary measurement via deactive TMP0 as part of AVM
const subreg_item  AVM_CONFIG__AVM_TMP1_MASK = 			{19 ,0b0000000000010000, "AVM_TMP1_MASK"};		 // RW - Activate auxiliary measurement via deactive TMP1 as part of AVM
const subreg_item  AVM_CONFIG__AVM_TMP2_MASK = 			{19 ,0b0000000000100000, "AVM_TMP2_MASK"};		 // RW - Activate auxiliary measurement via deactive TMP2 as part of AVM
const subreg_item  AVM_CONFIG__AVM_TMP3_MASK = 			{19 ,0b0000000001000000, "AVM_TMP3_MASK"};		 // RW - Activate auxiliary measurement via deactive TMP3 as part of AVM
const subreg_item  AVM_CONFIG__AVM_TMP4_MASK = 			{19 ,0b0000000010000000, "AVM_TMP4_MASK"};		 // RW - Activate auxiliary measurement via deactive TMP4 as part of AVM
const subreg_item  AVM_CONFIG__AUX_BIPOLAR = 			{19 ,0b0000000100000000, "AUX_BIPOLAR"};		 // RWH - Bipolar AUX measurement instead of BVM
const subreg_item  AVM_CONFIG__R_DIAG = 				{19 ,0b0000001000000000, "R_DIAG"};				 // RW - Masking diagnostics resistor as part of AVM
const subreg_item  AVM_CONFIG__R_DIAG_SEL_0 = 			{19 ,0b0001100000000000, "R_DIAG_SEL_0"};		 // RW - R_DIAG current source 0
const subreg_item  AVM_CONFIG__R_DIAG_SEL_1 = 			{19 ,0b0110000000000000, "R_DIAG_SEL_1"};		 // RW - R_DIAG current source 1
const subreg_item  AVM_CONFIG__R_DIAG_CUR_SRC = 		{19 ,0b1000000000000000, "R_DIAG_CUR_SRC"};		 // RW - R_DIAG current source selection
const subreg_item  MEAS_CTRL__CVM_DEL = 				{20 ,0b0000000000011111, "CVM_DEL"};			 // RW - Wait time before CVM and/or BVM is started when PBOFF=1
const subreg_item  MEAS_CTRL__PBOFF = 					{20 ,0b0000000000100000, "PBOFF"};				 // RW - Enable PBOFF
const subreg_item  MEAS_CTRL__SCVM_START = 				{20 ,0b0000000001000000, "SCVM_START"};			 // RWH - Start secondary cell voltage measurement Bit cleared if conversion done
const subreg_item  MEAS_CTRL__AVM_START = 				{20 ,0b0000000010000000, "AVM_START"};			 // RWH - Start auxillary voltage measurement Bit cleared if conversion done
const subreg_item  MEAS_CTRL__BVM_MODE = 				{20 ,0b0000011100000000, "BVM_MODE"};			 // RW - Block voltage measurement mode
const subreg_item  MEAS_CTRL__BVM_START = 				{20 ,0b0000100000000000, "BVM_START"};			 // RWH - Start block voltage measurement Bit cleared if conversion done
const subreg_item  MEAS_CTRL__CVM_MODE = 				{20 ,0b0111000000000000, "CVM_MODE"};			 // RW - Cell voltage measurement mode
const subreg_item  MEAS_CTRL__PCVM_START = 				{20 ,0b1000000000000000, "PCVM_START"};			 // RWH - Start primary cell voltage measurement Bit cleared if conversion done
const subreg_item  PCVM_0__RESULT = 					{21 ,0b1111111111111111, "RESULT"};				 // RH - Result of cell voltage measurement
const subreg_item  PCVM_1__RESULT = 					{22 ,0b1111111111111111, "RESULT"};				 // RH - Result of cell voltage measurement
const subreg_item  PCVM_2__RESULT = 					{23 ,0b1111111111111111, "RESULT"};				 // RH - Result of cell voltage measurement
const subreg_item  PCVM_3__RESULT = 					{24 ,0b1111111111111111, "RESULT"};				 // RH - Result of cell voltage measurement
const subreg_item  PCVM_4__RESULT = 					{25 ,0b1111111111111111, "RESULT"};				 // RH - Result of cell voltage measurement
const subreg_item  PCVM_5__RESULT = 					{26 ,0b1111111111111111, "RESULT"};				 // RH - Result of cell voltage measurement
const subreg_item  PCVM_6__RESULT = 					{27 ,0b1111111111111111, "RESULT"};				 // RH - Result of cell voltage measurement
const subreg_item  PCVM_7__RESULT = 					{28 ,0b1111111111111111, "RESULT"};				 // RH - Result of cell voltage measurement
const subreg_item  PCVM_8__RESULT = 					{29 ,0b1111111111111111, "RESULT"};				 // RH - Result of cell voltage measurement
