Infineon/IMR_PSoC6_BMS/proj_cm4/Libraries/BMS_TLE9012/tle9012_registers.c
const subreg_item  PCVM_9__RESULT = 					{30 ,0b1111111111111111, "RESULT"};				 // RH - Result of cell voltage measurement
const subreg_item  PCVM_10__RESULT = 					{31 ,0b1111111111111111, "RESULT"};				 // RH - Result of cell voltage measurement
const subreg_item  PCVM_11__RESULT = 					{32 ,0b1111111111111111, "RESULT"};				 // RH - Result of cell voltage measurement
const subreg_item  SCVM_HIGH__UPD_CNT = 				{33 ,0b0000000000000011, "UPD_CNT"};			 // RH - Update counter
const subreg_item  SCVM_HIGH__RESULT = 					{33 ,0b1111111111100000, "RESULT"};				 // RH - Result of SCVM measurement (highest cell voltage)
const subreg_item  SCVM_LOW__UPD_CNT = 					{34 ,0b0000000000000011, "UPD_CNT"};			 // RH - Update counter
const subreg_item  SCVM_LOW__RESULT = 					{34 ,0b1111111111100000, "RESULT"};				 // RH - Result of SCVM measurement (lowest cell voltage)
const subreg_item  STRESS_PCVM__STRESS_CORRECTION = 	{35 ,0b1111111111111111, "STRESS_CORRECTION"};	 // RH - Stress correction value PCVM
const subreg_item  BVM__RESULT = 						{36 ,0b1111111111111111, "RESULT"};				 // RH - Result of block voltage measurement
const subreg_item  EXT_TEMP_0__RESULT = 				{37 ,0b0000001111111111, "RESULT"};				 // RH - Result of external temp measurement SD-ADC result of resistance or voltage measurement.
const subreg_item  EXT_TEMP_0__INTC = 					{37 ,0b0000110000000000, "INTC"};				 // RH - Indicates which current source was used Number of current source that was active for latest measurement.
const subreg_item  EXT_TEMP_0__PULLDOWN = 				{37 ,0b0001000000000000, "PULLDOWN"};			 // RH - Indicating pull-down switch state
const subreg_item  EXT_TEMP_0__VALID = 					{37 ,0b0010000000000000, "VALID"};				 // ROCR - Indicating a valid result
const subreg_item  EXT_TEMP_0__PD_ERR = 				{37 ,0b0100000000000000, "PD_ERR"};				 // ROCW - Pull-down error Can also be cleared on write '0' to GEN_DIAG.EXT_T_ERR register bit.
const subreg_item  EXT_TEMP_1__RESULT = 				{38 ,0b0000001111111111, "RESULT"};				 // RH - Result of external temp measurement SD-ADC result of resistance or voltage measurement.
const subreg_item  EXT_TEMP_1__INTC = 					{38 ,0b0000110000000000, "INTC"};				 // RH - Indicates which current source was used Number of current source that was active for latest measurement.
const subreg_item  EXT_TEMP_1__PULLDOWN = 				{38 ,0b0001000000000000, "PULLDOWN"};			 // RH - Indicating pull-down switch state
const subreg_item  EXT_TEMP_1__VALID = 					{38 ,0b0010000000000000, "VALID"};				 // ROCR - Indicating a valid result
const subreg_item  EXT_TEMP_1__PD_ERR = 				{38 ,0b0100000000000000, "PD_ERR"};				 // ROCW - Pull-down error Can also be cleared on write '0' to GEN_DIAG.EXT_T_ERR register bit.
const subreg_item  EXT_TEMP_2__RESULT = 				{39 ,0b0000001111111111, "RESULT"};				 // RH - Result of external temp measurement SD-ADC result of resistance or voltage measurement.
const subreg_item  EXT_TEMP_2__INTC = 					{39 ,0b0000110000000000, "INTC"};				 // RH - Indicates which current source was used Number of current source that was active for latest measurement.
const subreg_item  EXT_TEMP_2__PULLDOWN = 				{39 ,0b0001000000000000, "PULLDOWN"};			 // RH - Indicating pull-down switch state
const subreg_item  EXT_TEMP_2__VALID = 					{39 ,0b0010000000000000, "VALID"};				 // ROCR - Indicating a valid result
const subreg_item  EXT_TEMP_2__PD_ERR = 				{39 ,0b0100000000000000, "PD_ERR"};				 // ROCW - Pull-down error Can also be cleared on write '0' to GEN_DIAG.EXT_T_ERR register bit.
const subreg_item  EXT_TEMP_3__RESULT = 				{40 ,0b0000001111111111, "RESULT"};				 // RH - Result of external temp measurement SD-ADC result of resistance or voltage measurement.
const subreg_item  EXT_TEMP_3__INTC = 					{40 ,0b0000110000000000, "INTC"};				 // RH - Indicates which current source was used Number of current source that was active for latest measurement.
const subreg_item  EXT_TEMP_3__PULLDOWN = 				{40 ,0b0001000000000000, "PULLDOWN"};			 // RH - Indicating pull-down switch state
const subreg_item  EXT_TEMP_3__VALID = 					{40 ,0b0010000000000000, "VALID"};				 // ROCR - Indicating a valid result
const subreg_item  EXT_TEMP_3__PD_ERR = 				{40 ,0b0100000000000000, "PD_ERR"};				 // ROCW - Pull-down error Can also be cleared on write '0' to GEN_DIAG.EXT_T_ERR register bit.
const subreg_item  EXT_TEMP_4__RESULT = 				{41 ,0b0000001111111111, "RESULT"};				 // RH - Result of external temp measurement SD-ADC result of resistance or voltage measurement.
const subreg_item  EXT_TEMP_4__INTC = 					{41 ,0b0000110000000000, "INTC"};				 // RH - Indicates which current source was used Number of current source that was active for latest measurement.
const subreg_item  EXT_TEMP_4__PULLDOWN = 				{41 ,0b0001000000000000, "PULLDOWN"};			 // RH - Indicating pull-down switch state
const subreg_item  EXT_TEMP_4__VALID = 					{41 ,0b0010000000000000, "VALID"};				 // ROCR - Indicating a valid result
const subreg_item  EXT_TEMP_4__PD_ERR = 				{41 ,0b0100000000000000, "PD_ERR"};				 // ROCW - Pull-down error Can also be cleared on write '0' to GEN_DIAG.EXT_T_ERR register bit.
const subreg_item  EXT_TEMP_R_DIAG__RESULT = 			{42 ,0b0000001111111111, "RESULT"};				 // RH - Result of diagnostics resistor measurement SD-ADC result of diagnostics resistor measurement.
const subreg_item  EXT_TEMP_R_DIAG__INTC = 				{42 ,0b0000110000000000, "INTC"};				 // RH - Indicates which current source was used Number of current source that was active for latest measurement.
const subreg_item  EXT_TEMP_R_DIAG__CUR_SRC = 			{42 ,0b0001000000000000, "CUR_SRC"};			 // RH - Indicates which current source was used
const subreg_item  EXT_TEMP_R_DIAG__VALID = 			{42 ,0b0010000000000000, "VALID"};				 // ROCR - Indicating a valid result
const subreg_item  INT_TEMP__RESULT = 					{43 ,0b0000001111111111, "RESULT"};				 // RH - Result of internal temperatur measurement SD-ADC result of internal temperature measurement.
const subreg_item  INT_TEMP__VALID = 					{43 ,0b0010000000000000, "VALID"};				 // ROCR - Indicating a valid result
const subreg_item  MULTI_READ__RES = 					{44 ,0b1111111111111111, "RES"};				 // RH - Used in combination with MULTI_READ_CFG Reading this register by the host starts the multiple register readroutine which got define in the MULTI_READ_CFG register.
const subreg_item  MULTI_READ_CFG__PCVM_SEL = 			{45 ,0b0000000000001111, "PCVM_SEL"};			 // RW - Selects which PCVM results are part of the multiread No PCVM result for 1101B...1111B
const subreg_item  MULTI_READ_CFG__BVM_SEL = 			{45 ,0b0000000000010000, "BVM_SEL"};			 // RW - Selects if BVM result is part of multiread
const subreg_item  MULTI_READ_CFG__EXT_TEMP_SEL = 		{45 ,0b0000000011100000, "EXT_TEMP_SEL"};		 // RW - Selects which TEMP result is part of the multiread
const subreg_item  MULTI_READ_CFG__EXT_TEMP_R_SEL = 	{45 ,0b0000000100000000, "EXT_TEMP_R_SEL"};		 // RW - Selects if R_DIAG result is part of the multiread
const subreg_item  MULTI_READ_CFG__INT_TEMP_SEL = 		{45 ,0b0000001000000000, "INT_TEMP_SEL"};		 // RW - 0B NO_INT_TMP_RES: No INT_TEMP result (default)
const subreg_item  MULTI_READ_CFG__SCVM_SEL = 			{45 ,0b0000010000000000, "SCVM_SEL"};			 // RW - Selects if SCVM results are part of the multiread
const subreg_item  MULTI_READ_CFG__STRESS_PCVM_SEL = 	{45 ,0b0000100000000000, "STRESS_PCVM_SEL"};	 // RW - Selects if PCVM stress correction value is part of the multiread
const subreg_item  BAL_DIAG_OC__OC_i = 					{46 ,0b0000111111111111, "OC_i"};				 // ROCW - Balancing overcurrent in cell i Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  BAL_DIAG_UC__UC_i = 					{47 ,0b0000111111111111, "UC_i"};				 // ROCW - Balancing undercurrent in cell i Can also be cleared on write '0' to connected GEN_DIAG register bit.
const subreg_item  INT_TEMP_2__RESULT = 				{48 ,0b0000001111111111, "RESULT"};				 // RH - Result of internal temperatur 2 measurement SD-ADC result of internal temperature 2 measurement.
const subreg_item  INT_TEMP_2__VALID = 					{48 ,0b0010000000000000, "VALID"};				 // ROCR - Indicating a valid result
const subreg_item  CONFIG__NODE_ID = 					{49 ,0b0000000000111111, "NODE_ID"};			 // RWO - Address (ID) of the node, distributed during enumeration NODE_ID = 0 --> iso UART signals are not forwardedNODE_ID = 63 --> reserved for broadcast commands
const subreg_item  CONFIG__EN_ALL_ADC = 				{49 ,0b0000001000000000, "EN_ALL_ADC"};			 // RW - Enable all ADCs If this bit is set, PCVM is done for each channel, independent ofPART_CONFIG setup.
const subreg_item  CONFIG__FN = 						{49 ,0b0000100000000000, "FN"};					 // RWO - Final Node The final node in stack must have this bit set. If final node does nothave FN set, no reply frame on broadcast will be sent.
const subreg_item  GPIO__IN_GPIO0 = 					{50 ,0b0000000000000001, "IN_GPIO0"};			 // RH - GPIO 0 input state (ignored if communication over GPIO pins)
const subreg_item  GPIO__OUT_GPIO0 = 					{50 ,0b0000000000000010, "OUT_GPIO0"};			 // RW - GPIO 0 output setting (ignored if communication over GPIO pins)
const subreg_item  GPIO__DIR_GPIO0 = 					{50 ,0b0000000000000100, "DIR_GPIO0"};			 // RW - GPIO 0 direction (ignored if communication over GPIO pins)
const subreg_item  GPIO__IN_GPIO1 = 					{50 ,0b0000000000001000, "IN_GPIO1"};			 // RH - GPIO 1 input state (ignored if communication over GPIO pins)
const subreg_item  GPIO__OUT_GPIO1 = 					{50 ,0b0000000000010000, "OUT_GPIO1"};			 // RW - GPIO 1 output setting (ignored if communication over GPIO pins)
const subreg_item  GPIO__DIR_GPIO1 = 					{50 ,0b0000000000100000, "DIR_GPIO1"};			 // RW - GPIO 1 direction (ignored if communication over GPIO pins)
const subreg_item  GPIO__IN_PWM1 = 						{50 ,0b0000000001000000, "IN_PWM1"};			 // RH - PWM 1 input state
const subreg_item  GPIO__PWM_PWM1 = 					{50 ,0b0000000010000000, "PWM_PWM1"};			 // RW - PWM 1 enable PWM function
const subreg_item  GPIO__OUT_PWM1 = 					{50 ,0b0000000100000000, "OUT_PWM1"};			 // RW - PWM 1 output setting
const subreg_item  GPIO__DIR_PWM1 = 					{50 ,0b0000001000000000, "DIR_PWM1"};			 // RW - PWM 1 direction
const subreg_item  GPIO__IN_PWM0 = 						{50 ,0b0000010000000000, "IN_PWM0"};			 // RH - PWM 0 input state
const subreg_item  GPIO__PWM_PWM0 = 					{50 ,0b0000100000000000, "PWM_PWM0"};			 // RW - PWM 0 enable PWM function
const subreg_item  GPIO__OUT_PWM0 = 					{50 ,0b0001000000000000, "OUT_PWM0"};			 // RW - PWM 0 Output Setting
const subreg_item  GPIO__DIR_PWM0 = 					{50 ,0b0010000000000000, "DIR_PWM0"};			 // RW - PWM 0 direction
const subreg_item  GPIO__VIO_UV = 						{50 ,0b1000000000000000, "VIO_UV"};				 // ROCW - VIO undervoltage error
const subreg_item  GPIO_PWM__PWM_DUTY_CYCLE = 			{51 ,0b0000000000011111, "PWM_DUTY_CYCLE"};		 // RW - PWM duty cycle 0 - 100%
const subreg_item  GPIO_PWM__PWM_PERIOD = 				{51 ,0b0001111100000000, "PWM_PERIOD"};			 // RW - PWM period time setting 2us - 62us
const subreg_item  ICVID__VERSION_ID = 					{52 ,0b0000000011111111, "VERSION_ID"};			 // RH - Version ID Read only version ID.
const subreg_item  ICVID__MANUFACTURER_ID = 			{52 ,0b1111111100000000, "MANUFACTURER_ID"};	 // RH - Manufacturer ID Read only manufacture ID.
const subreg_item  MAILBOX__DATA = 						{53 ,0b1111111111111111, "DATA"};				 // RW - Data storage register 2 data byte data storage
const subreg_item  CUSTOMER_ID_0__DATA = 				{54 ,0b1111111111111111, "DATA"};				 // RH - Unique ID part 1
const subreg_item  CUSTOMER_ID_1__DATA = 				{55 ,0b1111111111111111, "DATA"};				 // RH - Unique ID part 2
const subreg_item  WDOG_CNT__WD_CNT = 					{56 ,0b0000000001111111, "WD_CNT"};				 // RWH - Watchdog counter
const subreg_item  WDOG_CNT__MAIN_CNT = 				{56 ,0b1111111110000000, "MAIN_CNT"};			 // RH - Main counter Used to enable host controller to measure the main oscillatorfrequency. LSB = t Count_LSB. Reset by write access to WD_CNT ifRR_SYNC=1.
const subreg_item  SCVM_CONFIG__EN_SCVMi = 				{57 ,0b0000111111111111, "EN_SCVMi"};			 // RW - Enable SCVM for cell i
const subreg_item  STRESS_AUX__STRESS_CORRECTION = 		{58 ,0b1111111111111111, "STRESS_CORRECTION"};	 // RH - Stress correction value PCVM
const subreg_item  BAL_PWM__BAL_PWM = 					{59 ,0b0000000000000111, "BAL_PWM"};			 // RW - PWM balancing, starts with off-phase
const subreg_item  BAL_CNT_0__BAL_CNT_0 = 				{60 ,0b0000000000011111, "BAL_CNT_0"};			 // RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
const subreg_item  BAL_CNT_0__BAL_CNT_1 = 				{60 ,0b0000001111100000, "BAL_CNT_1"};			 // RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
const subreg_item  BAL_CNT_0__BAL_CNT_2 = 				{60 ,0b0111110000000000, "BAL_CNT_2"};			 // RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
const subreg_item  BAL_CNT_1__BAL_CNT_3 = 				{61 ,0b0000000000011111, "BAL_CNT_3"};			 // RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
const subreg_item  BAL_CNT_1__BAL_CNT_4 = 				{61 ,0b0000001111100000, "BAL_CNT_4"};			 // RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
const subreg_item  BAL_CNT_1__BAL_CNT_5 = 				{61 ,0b0111110000000000, "BAL_CNT_5"};			 // RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
const subreg_item  BAL_CNT_2__BAL_CNT_6 = 				{62 ,0b0000000000011111, "BAL_CNT_6"};			 // RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
const subreg_item  BAL_CNT_2__BAL_CNT_7 = 				{62 ,0b0000001111100000, "BAL_CNT_7"};			 // RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
const subreg_item  BAL_CNT_2__BAL_CNT_8 = 				{62 ,0b0111110000000000, "BAL_CNT_8"};			 // RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
const subreg_item  BAL_CNT_3__BAL_CNT_9 = 				{63 ,0b0000000000011111, "BAL_CNT_9"};			 // RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
const subreg_item  BAL_CNT_3__BAL_CNT_10 = 				{63 ,0b0000001111100000, "BAL_CNT_10"};			 // RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.
const subreg_item  BAL_CNT_3__BAL_CNT_11 = 				{63 ,0b0111110000000000, "BAL_CNT_11"};			 // RW - Balancing counter to switch off balancing after a certain time, counter is (re-)started by a write access to WDOG_CNT when EXT_WD=1.

// Concatenation of all subregister items used for iteration
const subreg_item* subreg_items[NUM_SUBREGISTERS] = {
	&PART_CONFIG__EN_CELLi, &PART_CONFIG__EN_CELL11,
	&OL_OV_THR__OV_THR, &OL_OV_THR__OL_THR_MAX, &OL_UV_THR__UV_THR,
	&OL_UV_THR__OL_THR_MIN, &TEMP_CONF__EXT_OT_THR, &TEMP_CONF__I_NTC,
	&TEMP_CONF__NR_TEMP_SENSE, &INT_OT_WARN_CONF__INT_OT_THR,
	&RR_ERR_CNT__NR_ERR, &RR_ERR_CNT__NR_EXT_TEMP_START,
	&RR_ERR_CNT__RR_SLEEP_CNT, &RR_CONFIG__RR_CNT, &RR_CONFIG__RR_SYNC,
	&RR_CONFIG__M_NR_ERR_ADC_ERR, &RR_CONFIG__M_NR_ERR_OL_ERR,
	&RR_CONFIG__M_NR_ERR_EXT_T_ERR, &RR_CONFIG__M_NR_ERR_INT_OT,
	&RR_CONFIG__M_NR_ERR_CELL_UV, &RR_CONFIG__M_NR_ERR_CELL_OV,
	&RR_CONFIG__M_NR_ERR_BAL_UC, &RR_CONFIG__M_NR_ERR_BAL_OC,
	&FAULT_MASK__ERR_PIN, &FAULT_MASK__M_ADC_ERR, &FAULT_MASK__M_OL_ERR,
	&FAULT_MASK__M_INT_IC_ERR, &FAULT_MASK__M_REG_CRC_ERR,
	&FAULT_MASK__M_EXT_T_ERR, &FAULT_MASK__M_INT_OT,
	&FAULT_MASK__M_CELL_UV, &FAULT_MASK__M_CELL_OV,
	&FAULT_MASK__M_BAL_ERR_UC, &FAULT_MASK__M_BAL_ERR_OC,
	&GEN_DIAG__UART_WAKEUP, &GEN_DIAG__MOT_MOB_N, &GEN_DIAG__BAL_ACTIVE,
	&GEN_DIAG__LOCK_MEAS, &GEN_DIAG__RR_ACTIVE, &GEN_DIAG__PS_ERR_SLEEP,
	&GEN_DIAG__ADC_ERR, &GEN_DIAG__OL_ERR, &GEN_DIAG__INT_IC_ERR,
	&GEN_DIAG__REG_CRC_ERR, &GEN_DIAG__EXT_T_ERR, &GEN_DIAG__INT_OT,
	&GEN_DIAG__CELL_UV, &GEN_DIAG__CELL_OV, &GEN_DIAG__BAL_ERR_UC,
	&GEN_DIAG__BAL_ERR_OC, &CELL_UV__UV_i, &CELL_OV__OV_i,
	&EXT_TEMP_DIAG__OPEN0, &EXT_TEMP_DIAG__SHORT0, &EXT_TEMP_DIAG__OT0,
	&EXT_TEMP_DIAG__OPEN1, &EXT_TEMP_DIAG__SHORT1, &EXT_TEMP_DIAG__OT1,
	&EXT_TEMP_DIAG__OPEN2, &EXT_TEMP_DIAG__SHORT2, &EXT_TEMP_DIAG__OT2,
	&EXT_TEMP_DIAG__OPEN3, &EXT_TEMP_DIAG__SHORT3, &EXT_TEMP_DIAG__OT3,
	&EXT_TEMP_DIAG__OPEN4, &EXT_TEMP_DIAG__SHORT4, &EXT_TEMP_DIAG__OT4,
	&DIAG_OL__OL_i, &REG_CRC_ERR__ADDR, &CELL_UV_DAC_COMP__UV_i,
	&CELL_OV_DAC_COMP__OV_i, &OP_MODE__PD, &OP_MODE__EXT_WD,
	&OP_MODE__SLEEP_REG_RESET, &OP_MODE__I_DIAG_EN, &OP_MODE__LR_TIME,
	&BAL_CURR_THR__OC_THR, &BAL_CURR_THR__UC_THR,
	&AVM_CONFIG__TEMP_MUX_DIAG_SEL, &AVM_CONFIG__AVM_TMP0_MASK,
	&AVM_CONFIG__AVM_TMP1_MASK, &AVM_CONFIG__AVM_TMP2_MASK,
	&AVM_CONFIG__AVM_TMP3_MASK, &AVM_CONFIG__AVM_TMP4_MASK,
	&AVM_CONFIG__AUX_BIPOLAR, &AVM_CONFIG__R_DIAG,
	&AVM_CONFIG__R_DIAG_SEL_0, &AVM_CONFIG__R_DIAG_SEL_1,
	&AVM_CONFIG__R_DIAG_CUR_SRC, &MEAS_CTRL__CVM_DEL, &MEAS_CTRL__PBOFF,
	&MEAS_CTRL__SCVM_START, &MEAS_CTRL__AVM_START, &MEAS_CTRL__BVM_MODE,
	&MEAS_CTRL__BVM_START, &MEAS_CTRL__CVM_MODE, &MEAS_CTRL__PCVM_START,
	&PCVM_0__RESULT, &PCVM_1__RESULT, &PCVM_2__RESULT, &PCVM_3__RESULT,
	&PCVM_4__RESULT, &PCVM_5__RESULT, &PCVM_6__RESULT, &PCVM_7__RESULT,
	&PCVM_8__RESULT, &PCVM_9__RESULT, &PCVM_10__RESULT, &PCVM_11__RESULT,
	&SCVM_HIGH__UPD_CNT, &SCVM_HIGH__RESULT, &SCVM_LOW__UPD_CNT,
	&SCVM_LOW__RESULT, &STRESS_PCVM__STRESS_CORRECTION, &BVM__RESULT,
	&EXT_TEMP_0__RESULT, &EXT_TEMP_0__INTC, &EXT_TEMP_0__PULLDOWN,
	&EXT_TEMP_0__VALID, &EXT_TEMP_0__PD_ERR, &EXT_TEMP_1__RESULT,
	&EXT_TEMP_1__INTC, &EXT_TEMP_1__PULLDOWN, &EXT_TEMP_1__VALID,
	&EXT_TEMP_1__PD_ERR, &EXT_TEMP_2__RESULT, &EXT_TEMP_2__INTC,
	&EXT_TEMP_2__PULLDOWN, &EXT_TEMP_2__VALID, &EXT_TEMP_2__PD_ERR,
	&EXT_TEMP_3__RESULT, &EXT_TEMP_3__INTC, &EXT_TEMP_3__PULLDOWN,
	&EXT_TEMP_3__VALID, &EXT_TEMP_3__PD_ERR, &EXT_TEMP_4__RESULT,
	&EXT_TEMP_4__INTC, &EXT_TEMP_4__PULLDOWN, &EXT_TEMP_4__VALID,
	&EXT_TEMP_4__PD_ERR, &EXT_TEMP_R_DIAG__RESULT, &EXT_TEMP_R_DIAG__INTC,
	&EXT_TEMP_R_DIAG__CUR_SRC, &EXT_TEMP_R_DIAG__VALID, &INT_TEMP__RESULT,
	&INT_TEMP__VALID, &MULTI_READ__RES, &MULTI_READ_CFG__PCVM_SEL,
	&MULTI_READ_CFG__BVM_SEL, &MULTI_READ_CFG__EXT_TEMP_SEL,
	&MULTI_READ_CFG__EXT_TEMP_R_SEL, &MULTI_READ_CFG__INT_TEMP_SEL,
	&MULTI_READ_CFG__SCVM_SEL, &MULTI_READ_CFG__STRESS_PCVM_SEL,
	&BAL_DIAG_OC__OC_i, &BAL_DIAG_UC__UC_i, &INT_TEMP_2__RESULT,
	&INT_TEMP_2__VALID, &CONFIG__NODE_ID, &CONFIG__EN_ALL_ADC,
	&CONFIG__FN, &GPIO__IN_GPIO0, &GPIO__OUT_GPIO0, &GPIO__DIR_GPIO0,
	&GPIO__IN_GPIO1, &GPIO__OUT_GPIO1, &GPIO__DIR_GPIO1,
	&GPIO__IN_PWM1, &GPIO__PWM_PWM1, &GPIO__OUT_PWM1, &GPIO__DIR_PWM1,
	&GPIO__IN_PWM0, &GPIO__PWM_PWM0, &GPIO__OUT_PWM0, &GPIO__DIR_PWM0,
	&GPIO__VIO_UV, &GPIO_PWM__PWM_DUTY_CYCLE, &GPIO_PWM__PWM_PERIOD,
	&ICVID__VERSION_ID, &ICVID__MANUFACTURER_ID, &MAILBOX__DATA,
	&CUSTOMER_ID_0__DATA, &CUSTOMER_ID_1__DATA, &WDOG_CNT__WD_CNT,
	&WDOG_CNT__MAIN_CNT, &SCVM_CONFIG__EN_SCVMi, &STRESS_AUX__STRESS_CORRECTION,
	&BAL_PWM__BAL_PWM, &BAL_CNT_0__BAL_CNT_0, &BAL_CNT_0__BAL_CNT_1,
	&BAL_CNT_0__BAL_CNT_2, &BAL_CNT_1__BAL_CNT_3, &BAL_CNT_1__BAL_CNT_4,
	&BAL_CNT_1__BAL_CNT_5, &BAL_CNT_2__BAL_CNT_6, &BAL_CNT_2__BAL_CNT_7,
	&BAL_CNT_2__BAL_CNT_8, &BAL_CNT_3__BAL_CNT_9, &BAL_CNT_3__BAL_CNT_10,
	&BAL_CNT_3__BAL_CNT_11,
};

