Infineon/IMR_PSoC6_BMS/proj_cm4/Libraries/BMS_TLE9012/tle9012_registers.c
//****************************************************************************
// Register ready/error/queued bitmap functions - Every bit of these maps represents if the related register index is ready, without error or queued
//		When a command is queued    	  		  - 'queued' bit is set to 1 (prevents queuing of one register multiple times)
// 	 	When queue item is send 		  		  - 'ready'  bit is set to 0 (prevents conversion or usage of non-ready data)
//		When result received or timeout 		  - 'ready'  bit is set to 1 and 'queued' is set to 0 (regardless if error or OK)
//		When command/response fail, CRC fail, etc - 'error'  bit is set (check this before using the register data)
//
// Note: MULTI_READ will be treated differently but can be used the same way as all others.
//       This will check/set/reset all registers mentioned in multi_read_cfg_reg_idx_list that are written by tle9012_writeMultiReadConfig())
//       Using MULTI_READ without proper prior use of tle9012_writeMultiReadConfig() will result in catastrophic bugs (e.g. Simultaneous UART TX and RX, overflows, etc)
//
// nodeID		-> The ID of the node that shall be effected. Range 1 to TLE9012_NODES_SIZE
// reg_idx		-> The index of the register that shall be used, see register.h definitions.  E.g. PART_CONFIG etc
// isBroadcast  -> If set to 1 this will effect all nodes (will check/set/reset all bits of one register in all nodes)
//****************************************************************************
// READY FUNCTIONS
// Check if the ready bit for the register index is set
uint8_t checkRegisterReady_tle9012(uint8_t nodeID, uint8_t reg_index,
		uint8_t isBroadcast) {
	if(reg_index == MULTI_READ){
		uint8_t result = 1;
		for(uint8_t i = 0; i < multi_read_cfg_reg_idx_list_num; i++){
			result &= checkRegisterReady_tle9012(nodeID,
					multi_read_cfg_reg_idx_list[i], isBroadcast);
		}
		//DEBUGPRINTF_BITMAP_CHANGE("MULTI check result %d\r\n", result);
		return result;
	}
	else if(isBroadcast == 0)
		return (tle9012_nodes[nodeID-1].reg_items_ready_bitmap &
				((uint64_t)1 << ((uint64_t)reg_index))) != 0;
	else{
		uint64_t result = UINT64_MAX;
		uint8_t curNodeIdx = 0;
		do{
			result &= (tle9012_nodes[curNodeIdx].reg_items_ready_bitmap &
					((uint64_t)1 << ((uint64_t)reg_index)));
			DEBUGPRINTF_BITMAP_CHANGE("\t\t\tCheck ready register index "
					"%2d of Node index %2d: %d\r\n",
					reg_index, curNodeIdx, result != 0);
			curNodeIdx++;
		}while(curNodeIdx < TLE9012_NODES_SIZE);
		return result != 0;
	}
}
// Set ready bit for the the register index
void setRegisterReady_tle9012(uint8_t nodeID, uint8_t reg_index,
		uint8_t isBroadcast) {
	if(reg_index == MULTI_READ){
		for(uint8_t i = 0; i < multi_read_cfg_reg_idx_list_num; i++){
			setRegisterReady_tle9012(nodeID,
					multi_read_cfg_reg_idx_list[i], isBroadcast);
		}
	}
	else if(isBroadcast == 0){
		DEBUGPRINTF_BITMAP_CHANGE("\t\t\tRegister index "
				"%2d of NodeID %2d: Ready\r\n", reg_index, nodeID);
		tle9012_nodes[nodeID-1].reg_items_ready_bitmap |=
				((uint64_t)1 << ((uint64_t)reg_index));
	}
	else{
		uint8_t curNodeIdx = 0;
		do{
			DEBUGPRINTF_BITMAP_CHANGE("\t\t\tRegister index "
					"%2d of Node index %2d: Ready\r\n",
					reg_index, curNodeIdx);
			tle9012_nodes[curNodeIdx].reg_items_ready_bitmap |=
					((uint64_t)1 << ((uint64_t)reg_index));
			curNodeIdx++;
		}while(curNodeIdx < TLE9012_NODES_SIZE);
	}
}
// Reset ready bit for the the register index
void resetRegisterReady_tle9012(uint8_t nodeID, uint8_t reg_index,
		uint8_t isBroadcast) {
	if(reg_index == MULTI_READ){
		for(uint8_t i = 0; i < multi_read_cfg_reg_idx_list_num; i++){
			resetRegisterReady_tle9012(nodeID,
					multi_read_cfg_reg_idx_list[i], isBroadcast);
		}
	}
	else if(isBroadcast == 0){
		DEBUGPRINTF_BITMAP_CHANGE("\t\t\tRegister index "
				"%2d of NodeID %2d: NOT Ready\r\n", reg_index, nodeID);
		tle9012_nodes[nodeID-1].reg_items_ready_bitmap &=
				~((uint64_t)1 << ((uint64_t)reg_index));
	}
	else{
		uint8_t curNodeIdx = 0;
		do{
			DEBUGPRINTF_BITMAP_CHANGE("\t\t\tRegister index "
					"%2d of Node index %2d: NOT Ready\r\n", reg_index, curNodeIdx);
			tle9012_nodes[curNodeIdx].reg_items_ready_bitmap &=
					~((uint64_t)1 << ((uint64_t)reg_index));
			curNodeIdx++;
		}while(curNodeIdx < TLE9012_NODES_SIZE);
	}
}
// ERROR FUNCTIONS
// Check if the error bit for the register index is set
uint8_t checkRegisterError_tle9012(uint8_t nodeID, uint8_t reg_index,
		uint8_t isBroadcast) {
	if(reg_index == MULTI_READ){
		uint8_t result = 0;
		for(uint8_t i = 0; i < multi_read_cfg_reg_idx_list_num; i++){
			result |= checkRegisterError_tle9012(nodeID,
					multi_read_cfg_reg_idx_list[i], isBroadcast);
		}
		return result;
	}
	else if(isBroadcast == 0)
		return (tle9012_nodes[nodeID-1].reg_items_error_bitmap &
				((uint64_t)1 << ((uint64_t)reg_index))) != 0;
	else{
		uint64_t result = 0;
		uint8_t curNodeIdx = 0;
		do{
			result |= (tle9012_nodes[curNodeIdx].reg_items_error_bitmap &
					((uint64_t)1 << ((uint64_t)reg_index)));
			DEBUGPRINTF_BITMAP_CHANGE("\t\t\tCheck error register index "
					"%2d of Node index %2d: %d\r\n",
					reg_index, curNodeIdx, result != 0);
			curNodeIdx++;
		}while(curNodeIdx < TLE9012_NODES_SIZE);
		return result != 0;
	}
}
// Set error bit for the the register index
void setRegisterError_tle9012(uint8_t nodeID, uint8_t reg_index,
		uint8_t isBroadcast) {
	if(reg_index == MULTI_READ){
		for(uint8_t i = 0; i < multi_read_cfg_reg_idx_list_num; i++){
			setRegisterError_tle9012(nodeID,
					multi_read_cfg_reg_idx_list[i], isBroadcast);
		}
	}
	else if(isBroadcast == 0){
		DEBUGPRINTF_BITMAP_CHANGE("\t\t\tRegister index "
				"%2d of Node ID %2d: Error\r\n", reg_index, nodeID);
		tle9012_nodes[nodeID-1].reg_items_error_bitmap |=
				((uint64_t)1 << ((uint64_t)reg_index));
	}
	else{
		uint8_t curNodeIdx = 0;
		do{
			DEBUGPRINTF_BITMAP_CHANGE("\t\t\tRegister index "
					"%2d of Node index %2d: Error\r\n", reg_index, curNodeIdx);
			tle9012_nodes[curNodeIdx].reg_items_error_bitmap |=
					((uint64_t)1 << ((uint64_t)reg_index));
			curNodeIdx++;
		}while(curNodeIdx < TLE9012_NODES_SIZE);
	}
}
// Reset error bit for the the register index
void resetRegisterError_tle9012(uint8_t nodeID, uint8_t reg_index,
		uint8_t isBroadcast) {
	if(reg_index == MULTI_READ){
		for(uint8_t i = 0; i < multi_read_cfg_reg_idx_list_num; i++){
			resetRegisterError_tle9012(nodeID,
					multi_read_cfg_reg_idx_list[i], isBroadcast);
		}
	}
	else if(isBroadcast == 0){
		DEBUGPRINTF_BITMAP_CHANGE("\t\t\tRegister index "
				"%2d of Node ID %2d: NO Error\r\n", reg_index, nodeID);
		tle9012_nodes[nodeID-1].reg_items_error_bitmap &=
				~((uint64_t)1 << ((uint64_t)reg_index));
	}
	else{
		uint8_t curNodeIdx = 0;
		do{
			DEBUGPRINTF_BITMAP_CHANGE("\t\t\tRegister index "
					"%2d of Node index %2d: NO Error\r\n", reg_index, curNodeIdx);
			tle9012_nodes[curNodeIdx].reg_items_error_bitmap &=
					~((uint64_t)1 << ((uint64_t)reg_index));
			curNodeIdx++;
		}while(curNodeIdx < TLE9012_NODES_SIZE);
	}
}
// QUEUED FUNCTIONS
// Check if the queued bit for the register index is set
uint8_t checkRegisterQueued_tle9012(uint8_t nodeID, uint8_t reg_index,
		uint8_t isBroadcast) {
	if(reg_index == MULTI_READ){
		uint8_t result = 1;
		for(uint8_t i = 0; i < multi_read_cfg_reg_idx_list_num; i++){
			result &= checkRegisterQueued_tle9012(nodeID,
					multi_read_cfg_reg_idx_list[i], isBroadcast);
		}
		return result;
	}
	else if(isBroadcast == 0)
		return (tle9012_nodes[nodeID-1].reg_items_queued_bitmap &
				((uint64_t)1 << ((uint64_t)reg_index))) != 0;
	else{
		uint64_t result = UINT64_MAX;
		uint8_t curNodeIdx = 0;
		do{
			result &= (tle9012_nodes[curNodeIdx].reg_items_queued_bitmap &
					((uint64_t)1 << ((uint64_t)reg_index)));
			/*DEBUGPRINTF_BITMAP_CHANGE("\t\t\tCheck Queued register index "
					"%2d of Node index %2d: %d\r\n",
					reg_index, curNodeIdx, result != 0);*/
			curNodeIdx++;
		}while(curNodeIdx < TLE9012_NODES_SIZE);
		return result != 0;
	}
}
// Set queued bit for the the register index
void setRegisterQueued_tle9012(uint8_t nodeID, uint8_t reg_index,
		uint8_t isBroadcast) {
	if(reg_index == MULTI_READ){
		for(uint8_t i = 0; i < multi_read_cfg_reg_idx_list_num; i++){
			setRegisterQueued_tle9012(nodeID,
					multi_read_cfg_reg_idx_list[i], isBroadcast);
		}
	}
	else if(isBroadcast == 0){
		DEBUGPRINTF_BITMAP_CHANGE("\t\t\tRegister index "
				"%2d of Node ID %2d: Queued\r\n", reg_index, nodeID);
		tle9012_nodes[nodeID-1].reg_items_queued_bitmap |=
				((uint64_t)1 << ((uint64_t)reg_index));
	}
	else{
		uint8_t curNodeIdx = 0;
		do{
			DEBUGPRINTF_BITMAP_CHANGE("\t\t\tRegister index "
					"%2d of Node index %2d: Queued\r\n", reg_index, curNodeIdx);
			tle9012_nodes[curNodeIdx].reg_items_queued_bitmap |=
					((uint64_t)1 << ((uint64_t)reg_index));
			curNodeIdx++;
		}while(curNodeIdx < TLE9012_NODES_SIZE);
	}
}
// Reset queued bit for the the register index
void resetRegisterQueued_tle9012(uint8_t nodeID, uint8_t reg_index,
		uint8_t isBroadcast) {
	if(reg_index == MULTI_READ){
		for(uint8_t i = 0; i < multi_read_cfg_reg_idx_list_num; i++){
			resetRegisterQueued_tle9012(nodeID,
					multi_read_cfg_reg_idx_list[i], isBroadcast);
		}
	}
	else if(isBroadcast == 0){
		DEBUGPRINTF_BITMAP_CHANGE("\t\t\tRegister index "
				"%2d of Node index %2d: NOT Queued\r\n", reg_index, nodeID);
		tle9012_nodes[nodeID-1].reg_items_queued_bitmap &=
				~((uint64_t)1 << ((uint64_t)reg_index));
	}
	else{
		uint8_t curNodeIdx = 0;
		do{
			DEBUGPRINTF_BITMAP_CHANGE("\t\t\tRegister index "
					"%2d of Node index %2d: NOT Queued\r\n", reg_index, curNodeIdx);
			tle9012_nodes[curNodeIdx].reg_items_queued_bitmap &=
					~((uint64_t)1 << ((uint64_t)reg_index));
			curNodeIdx++;
		}while(curNodeIdx < TLE9012_NODES_SIZE);
	}
}

//****************************************************************************
// setRegisterCacheDataByIndex
//****************************************************************************
 inline void setRegisterCacheDataByIndex_tle9012(uint8_t nodeID,
		 uint8_t reg_index, uint16_t reg_data)
{
	 tle9012_nodes[nodeID-1].reg_data[reg_index] = reg_data;
}

//****************************************************************************
// getRegisterCacheDataByIndex
//****************************************************************************
inline uint16_t getRegisterCacheDataByIndex_tle9012(uint8_t nodeID, uint8_t reg_index)
{
    return tle9012_nodes[nodeID-1].reg_data[reg_index];
}

//****************************************************************************
// sendWrite - Writes all 2 bytes to a given register to the ICs (ID specific based on node)
// NOTE: This works around the queuing system and can only be used if it is
// certain that no data is receive at that time.
//
// node         -> Pointer to the tle9012 node object representing one IC
// reg_address  -> Actual address of the register to be changed (not the index!)
// data         -> The 2 byte data that will be written
// isBroadcast  -> If 1 the write will be send as broadcast (all IDs)
//**********************************************************************
void sendWrite(tle9012_node* node, uint8_t reg_address, uint16_t data,
		uint8_t isBroadcast)
{
    if (isEnabled()) {
    	// Determine ID frame (send to ID or as broadcast?)
    	uint8_t ID;
    	if(isBroadcast)
    		ID = FRAME_ID_WRITE | FRAME_ID_BROADCAST;
    	else
    		ID = FRAME_ID_WRITE | node->ID;

