Infineon/IMR_PSoC6_BMS/proj_cm4/Libraries/BMS_TLE9012/tle9012_registers.c
    	// Compose write frame and send data
		tle9012_tx_buffer[0] = FRAME_SYNC;
		tle9012_tx_buffer[1] = ID;
		tle9012_tx_buffer[2] = reg_address;
		tle9012_tx_buffer[3] = (data >> 8);
		tle9012_tx_buffer[4] = data & 0xff;
		tle9012_tx_buffer[5] = crc8(tle9012_tx_buffer, 5);
		tle9012_tx_buffer_size = 6;
		uartWrite(tle9012_tx_buffer_size, 0);

		node->timeLastCommandSent = TIMER_COUNTER_1MS;
    }
    else {
        tle9012_problemDetected = 1;
        DEBUGPRINTF("[ERROR]: sendWrite - Device is disabled");
    }
}

//****************************************************************************
// sendRead - Reads all 2 bytes of a given register from the ICs (ID specific based on node)
// NOTE: This works around the queuing system and can only be used if it is
// certain that no data is receive at that time.
//
// node         -> Pointer to the tle9012 node object representing one IC
// reg_address  -> Actual address of the register to be read (not the index!)
// isBroadcast  -> If 1 the read will be send as broadcast (all IDs)
//**********************************************************************
void sendRead(tle9012_node* node, uint8_t reg_address, uint8_t isBroadcast)
{
    if (isEnabled()) {
    	// Determine ID frame (send to ID or as broadcast?)
    	uint8_t ID;
    	if(isBroadcast)
    		ID = FRAME_ID_READ | FRAME_ID_BROADCAST;
    	else
    		ID = FRAME_ID_READ | node->ID;

    	// Compose read frame and send data
		tle9012_tx_buffer[0] = FRAME_SYNC;
		tle9012_tx_buffer[1] = ID;
		tle9012_tx_buffer[2] = reg_address;
		tle9012_tx_buffer[3] = crc8(tle9012_tx_buffer, 3);
		tle9012_tx_buffer_size = 4;
		uartWrite(tle9012_tx_buffer_size, 0);

		node->timeLastCommandSent = TIMER_COUNTER_1MS;
    }
    else {
        tle9012_problemDetected = 1;
        DEBUGPRINTF("[ERROR]: sendRead - Device is disabled");
    }
}


//****************************************************************************
// sendWatchdogUpdate - Resets the watchdog counter to the highest value and
//                      therefore prevents device from going to sleep
// NOTE: This works around the queuing system and can only be used if it is
// certain that no data is receive at that time (e.g in manageQueue() EXECUTE_TX state or after an blocking command)
//
// nodeID       -> Pointer to the tle9012 node object representing one IC
// isBroadcast  -> If 1 the write will be send as broadcast (all IDs)
//**********************************************************************
void sendWatchdogUpdate(uint8_t nodeID, uint8_t isBroadcast)
{
    if (isEnabled()) {
    	// Determine ID frame (send to ID or as broadcast?)
    	uint8_t ID;
    	if(isBroadcast)
    		ID = FRAME_ID_WRITE | FRAME_ID_BROADCAST;
    	else
    		ID = FRAME_ID_WRITE | nodeID;

    	// Set register not ready
    	resetRegisterReady_tle9012(nodeID, WDOG_CNT, isBroadcast);

    	// Compose write frame and send data
		tle9012_tx_buffer[0] = FRAME_SYNC;
		tle9012_tx_buffer[1] = ID;
		tle9012_tx_buffer[2] = reg_items[WDOG_CNT].address;
		tle9012_tx_buffer[3] = (WD_CNT__127 >> 8);
		tle9012_tx_buffer[4] = WD_CNT__127 & 0xff;
		tle9012_tx_buffer[5] = crc8(tle9012_tx_buffer, 5);
		tle9012_tx_buffer_size = 6;
		uartWrite(tle9012_tx_buffer_size, 1);

		// Refresh interpreter until register is ready,
		// timeout occurred or the loop was executed to often (last resort)
		uint32_t startTime = TIMER_COUNTER_1MS;
		for(uint32_t i = 0; i<UINT32_MAX; i++){
			// Execute management of interpreter
			tle9012_manageInterpreter(tle9012_nodes, TLE9012_NODES_SIZE);

			// If blocking takes to long stop loop
			if(TIMER_COUNTER_1MS > (startTime + TIMEOUT_COMMAND+50)){
				DEBUGPRINTF("[ERROR]: sendWatchdogUpdate reply timeout "
						"after %ld ms (%ld loops) on Node %d \r\n",
						(uint32_t)(TIMER_COUNTER_1MS - startTime), i, nodeID);
				break;
			}

			// Stop loop if register ready
			if(checkRegisterReady_tle9012(nodeID, WDOG_CNT, isBroadcast)){
				DEBUGPRINTF_WATCHDOG("sendWatchdogUpdate reply received "
						"after %ld ms (took %ld ms and %ld loops) on Node %d \r\n",
						TIMER_COUNTER_1MS-timeLastWatchdogRefresh,
						TIMER_COUNTER_1MS - startTime, i, nodeID);
				timeLastWatchdogRefresh = TIMER_COUNTER_1MS;
				break;
			}
		}
    }
    else {
        tle9012_problemDetected = 1;
        DEBUGPRINTF_WATCHDOG("[ERROR]: sendWrite - Device is disabled");
    }
}

//****************************************************************************
// setConfigBit TODO untested
//
// only use this for latched bits - otherwise this will save the reset byte in cache
// The used register must be read to cache before this!
//
//****************************************************************************
void setConfigBit_tle9012(uint8_t nodeID, uint8_t state, uint8_t reg_index,
		uint16_t bit, uint8_t blocking, uint8_t isBroadcast)
{
	// Set state
	if (state == 0)
		clearBits_tle9012(nodeID, reg_index, bit, blocking, isBroadcast);
	else if (state == 1)
		setBits_tle9012(nodeID, reg_index, bit, blocking, isBroadcast);
	else {
		tle9012_problemDetected = 1;
		DEBUGPRINTF("[ERROR]: SetConfigBit - Invalid state\r\n");
	}
}

//****************************************************************************
// setBits TODO untested
//
// sets the bits in given register and writes register
// The used register must be read to cache before this!
//
//***************************************************************************
void setBits_tle9012(uint8_t nodeID, uint8_t reg_index,
		uint16_t bitmask, uint8_t blocking, uint8_t isBroadcast)
{
	if (isEnabled()) {
		// Get current register data
		uint16_t data = getRegisterCacheDataByIndex_tle9012(nodeID, reg_index);

		// Set bits
		data |= bitmask;

		// Write change to node
		tle9012_writeRegisterByIndex(nodeID, reg_index, data, blocking, isBroadcast);
	}
	else {
		DEBUGPRINTF("[ERROR]: Device is disabled");
	}
}

//****************************************************************************
// clearBits TODO untested
//
// clears the bits in given register and writes register
// (the used register must be read to cache before this!)
//
//***************************************************************************
void clearBits_tle9012(uint8_t nodeID, uint8_t reg_index,
		uint16_t bitmask, uint8_t blocking, uint8_t isBroadcast)
{
    if(isEnabled()){
    	// Get current register data
    	uint16_t data = getRegisterCacheDataByIndex_tle9012(nodeID, reg_index);

    	// Clear bits
    	data &= ~bitmask;

		// Write change to node
		tle9012_writeRegisterByIndex(nodeID, reg_index, data, blocking, isBroadcast);
    }
	else {
		DEBUGPRINTF("[ERROR]: Device is disabled");
	}
}
